/*
Localizable.strings
PanicGit

Created by Logan Collins on 2/24/18.
Copyright © 2018 Panic Inc. All rights reserved.
*/


// Operations

// "Downloading Objects: 12 of 100 (100KB)"
"Downloading Objects: %@ of %@ (%@)" = "ダウンロード: %@ / %@ (%@)";

// "Indexing Deltas: 12 of 100"
"Indexing Deltas: %@ of %@" = "デルタのインデックス処理: %@ / %@";

// "Packing Objects: 12 of 100"
"Packing Objects: %@ of %@" = "パック処理: %@ / %@";

// "Uploading Objects: 12 of 100 (100KB)"
"Uploading Objects: %@ of %@ (%@)" = "アップロード: %@ / %@ (%@)";

// "Checking Out Files: 12 of 100"
"Checking Out Files: %@ of %@" = "チェックアウト: %@ / %@";


// SSH host key authentication
"The %@ %@ fingerprint is:\n%@" = "%@ %@ フィンガープリント:\n%@";


// Errors
// "Error returned from libgit2: %@ (%ld)" = "--$$ STRING IS MISSING $$--";
"Error code from libgit2: (%ld)" = "libgit2からのエラーコード: (%ld)";

"The requested object was not found." = "要求されたオブジェクトが見つかりませんでした。";
"The requested object already exists." = "要求されたオブジェクトは既に存在します。";
"Multiple ambiguous matching objects were found." = "複数のマッチするあいまいなオブジェクトが見つかりました。";
"The provided buffer was too short." = "提供されたバッファが短すぎました。";
"This operation cannot be performed on a bare repository." = "この操作はベアリポジトリでは実行できません。";
"The branch contains no commits." = "このブランチにはコミットが含まれていません。";
"Unmerged changes must be resolved before the operation can be performed." = "マージされていない変更は、操作の実行前に解決する必要があります。";
"The reference cannot be fast-forwarded and must instead be merged or rebased." = "参照はfast-forwardできず、代わりにマージまたはリベースする必要があります。";
"The provided reference name or refspec was invalid." = "指定の参照名またはrefspecが無効です。";
"One or more conflicts prevented the operation from being performed.\n\nCommit or stash any uncommitted changes and try again." = "1つ以上の競合により操作を実行できませんでした。\n\n未コミットの項目をコミットするかスタッシュして再度お試しください。";
"There are locked files which prevented the operation from being performed." = "操作の実行を妨げているロックされたファイルがあります。";
"The reference has been modified by another operation." = "参照は別の操作によって変更されました。";
"Credentials were not accepted by the server. Make sure your password or SSH key is set up correctly.\n\nIf you are using an SSH config file, make sure it is not unexpectedly overriding options for the host." = "接続情報はサーバに許可されませんでした。パスワードまたはSSH認証鍵が正しく設定されていることをご確認ください。\n\nSSH configファイルを使用している場合、ホストのオプションを予期せず上書きしていないかもご確認ください。";
"The certificate for the server is invalid. Make sure you have a valid secure connection to the server and that there is not a proxy server that may be downgrading security." = "無効なサーバ証明書です。有効で安全な接続があり、セキュリティを低下させる可能性があるプロキシサーバが無いことをご確認ください。";
"The provided patch or merge has already been applied." = "提供されたパッチまたはマージはすでに適用済みです。";
"The requested peel operation is not possible." = "要求されたピール操作は実行できません。";
"An unexpected end of file was encountered." = "予期しないファイル終端が検出されました。";
"The requested operation or input is invalid." = "要求された操作または入力は無効です。";
"There are uncommitted changes which must be committed or stashed before the operation can be performed." = "操作の実行前に、コミットまたはスタッシュする必要のある未コミットの変更があります。";
"This operation is not valid for the specified directory." = "この操作は指定のディレクトリに対し無効です。";
"There are merge conflicts which must be resolved before the operation can be performed." = "操作の実行前に、解決する必要のあるマージ競合があります。";
"The hash sum of one or more objects does not match." = "1つ以上のオブジェクトのハッシュサムが一致しません。";
"Unsaved changes in the index would be overridden by the operation." = "インデックス内の未保存の変更は、操作によって上書きされます。";
"Failed to apply the patch." = "パッチの適用に失敗しました。";
"The object is not owned by the current user." = "オフジェクトは現在のユーザの所有ではありません。";
"The operation was cancelled." = "操作はキャンセルされました。";


// Tasks
"Failed to invoke Git “%@” hook." = "Git “%@” フックの起動に失敗しました。";
"Failed to invoke Git credential helper." = "Gitクレデンシャルヘルパーの起動に失敗しました。";

"Task “%@” terminated with an uncaught signal." = "タスク “%@” は未キャッチの信号で終了しました。";
"Task “%@” terminated with a non-zero exit code: %d." = "タスク “%@” はゼロ以外のコードで終了しました: %d。";


// Signing
"Invalid Git signing format specified." = "指定されたGit署名は無効な形式です。";
"The “gpg.format” configuration value is set to “%@”, which is not supported." = "“gpg.format”の値が “%@” に設定されていますが、これは未サポートです。";
"Could not sign payload using %@." = "%@ を使用してペイロードに署名できませんでした。";
"A valid signing key was not provided using either `user.signingkey` or `gpg.ssh.defaultKeyCommand`." = "`user.signingkey` または `gpg.ssh.defaultKeyCommand`を使用しても、有効な署名鍵が提供されませんでした。";
"Task “%@” did not generate a signature in its output." = "タスク “%@” は出力で署名を生成しませんでした。";


// Apply Stash
"Applying stash…" = "スタッシュを適用中…";
"Failed to apply stash." = "スタッシュの適用に失敗しました。";

// Checkout
"Checking out “%@”…" = "“%@” をチェックアウト中…";
"Checking out HEAD…" = "HEADをチェックアウト中…";

"Failed to checkout tree." = "ツリーのチェックアウトに失敗しました。";

// Cherry-pick
"Cherry-picking “%@”…" = "“%@” をチェリーピック中…";

"Failed to cherry-pick commits." = "コミットのチェリーピックに失敗しました。";

// Clone
"Cloning into “%@”…" = "“%@” にクローン中…";

"Failed to clone repository." = "リポジトリのクローンに失敗しました。";

// Commit
"Committing “%@”…" = "“%@” をコミット中…";

"Failed to commit tree." = "ツリーのコミットに失敗しました。";

// Fetch
"Fetching from “%@”…" = "“%@” からフェッチ中…";
"Fetching “%@” from “%@”…" = "“%@” を “%@” からフェッチ中…";
"Fetching %@ refs from “%@”…" = "参照 “%@” を “%@” からフェッチ中…";

"Failed to fetch from “%@”." = "“%@” からのフェッチに失敗しました。";

// List References
"Listing remote references for “%@”…" = "“%@” のリモート参照をリスト化中…"; // Where a "reference" is a Git remote reference (such as a branch or tag)

"Failed to fetch remote references from “%@”." = "“%@” からのリモート参照のフェッチに失敗しました。"; // Where a "reference" is a Git remote reference (such as a branch or tag)

// Merge
"Merging “%@”…" = "“%@” をマージ中…";
"Merging %@ references…" = "参照 %@ をマージ中…";

"Failed to merge references." = "参照のマージに失敗しました。";

// Prune
"Pruning references for “%@”…" = "参照 “%@” をプルーン中…";

"Failed to prune remote references from “%@”." = "“%@” からリモート参照のプルーンに失敗しました。";

// Push
"Pushing to “%@”…" = "“%@” へプッシュ中…";
"Pushing “%@” to “%@”…" = "“%@” を “%@” へプッシュ中…";
"Pushing %@ refs to “%@”…" = "参照 %@ を “%@” へプッシュ中…";

"Failed to push to “%@”." = "“%@” へのプッシュに失敗しました。";

"Failed to push some references." = "いくつかの参照をプッシュできませんでした。";
"One or more references were rejected by the server." = "1つ以上の参照がサーバによって拒否されました。";

// Update submodule
"Updating submodule “%@”…" = "サブモジュール “%@” を更新中…";

"Failed to update submodule “%@”." = "サブモジュール “%@” の更新に失敗しました。";
